{
  "data": {
    "length": 20,
    "english": {
      "title": "Imam Nawawi",
      "author": "Imam Yahya ibn Sharaf al-Nawawi",
      "introduction": "40 HADIS IMAM an-NAWAWI"
    }
  },
  "hadiths": [
    {
      "id": 1,
      "idInBook": 1,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: \"إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ\". \nرَوَاهُ إِمَامَا الْمُحَدِّثِينَ أَبُو عَبْدِ اللهِ مُحَمَّدُ بنُ إِسْمَاعِيل بن إِبْرَاهِيم بن الْمُغِيرَة بن بَرْدِزبَه الْبُخَارِيُّ الْجُعْفِيُّ  رَضِيَ اللهُ عَنْهُمَا فِي \"صَحِيحَيْهِمَا\" اللذَينِ هُمَا أَصَحُّ الْكُتُبِ الْمُصَنَّفَةِ",
      "english": {
        "narrator": "Diriwayatkan dari Amirul Mu'minin, Abu Hafs 'Umar bin al-Khattab (ra) berkata:",
        "text": "Aku mendengar Rasulullah ﷺ bersabda: \"Amalan itu (dinilai) dengan motif (niyyah), maka setiap orang akan memperoleh apa yang dia niatkan. Maka barangsiapa yang hijrahnya (hijrah) kepada Allah dan Rasul-Nya, hijrahnya adalah kepada Allah dan Rasul-Nya; tetapi sesiapa yang hijrahnya kerana dunia yang dia perolehi, atau kerana isteri yang dikahwininya, maka hijrahnya itu kepada apa yang dia berhijrah kepadanya.\""
      }
    },
    {
      "id": 2,
      "idInBook": 2,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \" بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ\"",
      "english": {
        "narrator": "Dari Abdullah, anak Umar al-Khattab (ra) berkata:",
        "text": "AKu mendengar Rasulullah ﷺ bersabda, “Islam itu dibangun di atas lima perkara: bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah dan Muhammad adalah utusan Allah, mendirikan solat, menunaikan zakat, mengerjakan haji ke Baitullah, dan berpuasa di bulan Ramadhan.\""
      }
    },
    {
      "id": 3,
      "idInBook": 3,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه و سلم -وَهُوَ الصَّادِقُ الْمَصْدُوقُ-: \"إنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٍّ أَمْ سَعِيدٍ؛ فَوَاَللَّهِ الَّذِي لَا إلَهَ غَيْرُهُ إنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا. وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا\"",
      "english": {
        "narrator": "Daripada Abdullah ibn Masood (ra) berkata:",
        "text": "Rasulullah s.a.w. adalah orang yang benar lagi beriman telah menceritakan kepada kami, \"Sesungguhnya setiap ciptaan kamu dikumpulkan dalam rahim ibunya selama empat puluh hari dalam bentuk nutfah (setitis), kemudian dia menjadi alaqah (segumpal darah) untuk tempoh yang sama, kemudian menjadi mudghah (segumpal daging) untuk tempoh yang sama, kemudian diutuskan kepadanya malaikat yang meniupkan ruhnya kepadanya dan yang diperintahkan dengan empat perkara. perkara: menulis rizqnya (rezeki), umurnya, amalnya, dan sama ada dia akan gembira atau tidak bahagia (iaitu, sama ada dia akan masuk syurga atau tidak).Demi Yang Esa, selain Dia yang ada. tiada tuhan, sesungguhnya salah seorang di antara kamu beramal dengan amalan ahli syurga sehingga jarak antara dia dan syurga hanya sejengkal, lalu didahului oleh apa yang telah tertulis, lalu dia beramal dengan amalan ahli neraka. maka masuk ke dalamnya; dan sesungguhnya salah seorang di antara kamu beramal dengan amalan ahli neraka, sehingga jarak antara dia dan neraka itu hanya sejengkal, dan apa yang telah tertulis menimpanya lalu dia beramal dengan amalan ahli neraka. Syurga dan dengan itu dia memasukinya.”"
      }
    },
    {
      "id": 4,
      "idInBook": 4,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللَّهِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، قَالَتْ: قَالَ: رَسُولُ اللَّهِ صلى الله عليه و سلم \"مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ\n \nوَفِي رِوَايَةٍ لِمُسْلِمٍ: مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ\"",
      "english": {
        "narrator": "Daripada Aisyah (ra) berkata:",
        "text": "Rasulullah (ﷺ) bersabda, \"Sesiapa yang membuat perkara baru dalam perkara kami ini (iaitu Islam) yang bukan daripadanya, maka ia ditolak (oleh Allah).\"Dalam versi lain dalam Muslim berbunyi: “Barangsiapa yang mengerjakan suatu amalan yang tidak kami perintahkan, maka ia tertolak (oleh Allah)."
      }
    },
    {
      "id": 5,
      "idInBook": 5,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"إنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقْد اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ\"",
      "english": {
        "narrator": "Daripada an-Nu’man ibn Basheer (ra), berkata:",
        "text": "Aku mendengar Rasulullah (ﷺ) bersabda, \"Yang halal itu jelas dan yang haram itu jelas, dan di antara keduanya ada perkara-perkara syubhat yang ramai manusia tidak mengetahuinya. orang yang menjauhi perkara yang syubhat telah membersihkan dirinya dalam agama dan kehormatannya, tetapi sesiapa yang terjerumus ke dalam perkara yang syubhat, sesungguhnya ia adalah hati.”"
      }
    },
    {
      "id": 6,
      "idInBook": 6,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي رُقَيَّةَ تَمِيمِ بْنِ أَوْسٍ الدَّارِيِّ رَضِيَ اللهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: \"الدِّينُ النَّصِيحَةُ.\" قُلْنَا: لِمَنْ؟ قَالَ: \"لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ\"",
      "english": {
        "narrator": "Daripada Tameem ibn Aus ad-Daree (ra):",
        "text": "Rasulullah ﷺ bersabda, “Dien (agama) adalah naseehah (nasihat, keikhlasan). Kami berkata, “Kepada siapa?” Beliau (ﷺ) bersabda, “Untuk Allah, Kitab-Nya, Rasul-Nya, dan kepada para pemimpin kaum Muslimin dan rakyat biasa mereka.”"
      }
    },
    {
      "id": 7,
      "idInBook": 7,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا، أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ؛ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إلَّا بِحَقِّ الْإِسْلَامِ، وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى\"",
      "english": {
        "narrator": "Daripada Abdullah ibn Umar (ra):",
        "text": "Rasulullah ﷺ bersabda, “Aku telah diperintahkan untuk memerangi manusia sehingga mereka bersaksi bahawa tiada Tuhan yang berhak disembah melainkan Allah dan Muhammad adalah utusan Allah, dan sehingga mereka mendirikan solat dan menunaikan zakat. . Dan jika mereka berbuat demikian maka mereka akan mendapat perlindungan dariku untuk jiwa dan harta mereka, kecuali dalam Islam, dan perhitungan mereka adalah pada Allah.\""
      }
    },
    {
      "id": 8,
      "idInBook": 8,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ \"",
      "english": {
        "narrator": "Daripada Abu Hurayrah (ra):",
        "text": "Aku mendengar Rasulullah ﷺ bersabda, “Apa yang aku larang atas kamu, jauhilah apa yang telah Aku perintahkan kepadamu yang sebelum kamu.\""
      }
    },
    {
      "id": 9,
      "idInBook": 9,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"إنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إلَّا طَيِّبًا، وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ تَعَالَى: \"يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا\"، وَقَالَ تَعَالَى: \"يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ\" ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إلَى السَّمَاءِ: يَا رَبِّ! يَا رَبِّ! وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِّيَ بِالْحَرَامِ، فَأَنَّى يُسْتَجَابُ لَهُ؟\"",
      "english": {
        "narrator": "Daripada Abu Hurayrah (ra):",
        "text": "Rasulullah ﷺ bersabda, “Sesungguhnya Allah itu Maha Baik dan hanya menerima yang baik. Dan sesungguhnya Allah telah memerintahkan orang-orang yang beriman supaya mengerjakan apa yang diperintahkan-Nya kepada para rasul.\n\nMaka Yang Maha Kuasa telah berfirman: “Wahai (kamu) Rasul-rasul! Makanlah tayyibat”\n\nKemudian dia (ﷺ) disebutkan akan dijawab?"
      }
    },
    {
      "id": 10,
      "idInBook": 10,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ سِبْطِ رَسُولِ اللَّهِ صلى الله عليه و سلم وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: حَفِظْت مِنْ رَسُولِ اللَّهِ صلى الله عليه و سلم \"دَعْ مَا يُرِيبُك إلَى مَا لَا يُرِيبُك\"\nرَوَاهُ التِّرْمِذِيُّ ،وَقَالَ التِّرْمِذِيُّ: حَدِيثٌ حَسَنٌ صَحِيحٌ",
      "english": {
        "narrator": "Dari Abu Muhammad al-Hasan bin Ali bin Abi Talib radhiyallahu ‘anhu, cucu Rasulullah shallallahu ‘alaihi wa sallam, dan orang yang sangat dicintainya, yang berkata:",
        "text": "Aku hafal dari Rasulullah s.a.w.: \"Tinggalkan perkara yang meragukan kamu kepada perkara yang tidak meragukan kamu.\""
      }
    },
    {
      "id": 11,
      "idInBook": 11,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"مِنْ حُسْنِ إسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ\". \nحَدِيثٌ حَسَنٌ، رَوَاهُ التِّرْمِذِيُّ",
      "english": {
        "narrator": "Daripada Abu Hurayrah berkata:",
        "text": "Rasulullah shallallahu 'alaihi wasallam bersabda, \"Sebahagian dari kesempurnaan keislaman seseorang adalah meninggalkan sesuatu yang tidak berguna baginya.\""
      }
    },
    {
      "id": 12,
      "idInBook": 12,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه و سلم عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: \"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ\". \nرَوَاهُ الْبُخَارِيُّ",
      "english": {
        "narrator": " Daripada Abu Hamzah Anas bin Malik  (hamba kepada Rasulullah s.a.w ) said:",
        "text": "Tidak beriman seseorang di antara kamu sehingga dia mencintai saudaranya seperti mana dia cintai untuk dirinya sendiri."
      }
    },
    {
      "id": 13,
      "idInBook": 13,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ  إلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ\"",
      "english": {
        "narrator": " Daripada Ibn Masood berkata:",
        "text": "Rasulullah s.a.w. bersabda, “Tidak halal menumpahkan darah seorang muslim kecuali pada tiga perkara: orang yang berkahwin yang berzina, satu nyawa dengan satu nyawa, dan orang yang meninggalkan agamanya dan berpisah dengan masyarakat”."
      }
    },
    {
      "id": 14,
      "idInBook": 14,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ\"",
      "english": {
        "narrator": "Daripada Abu Hurayrah, dimana Rasulullah s.a.w bersabda:",
        "text": "Sesiapa yang beriman kepada Allah dan hari akhirat hendaklah berkata yang baik atau diam; dan barangsiapa yang beriman kepada Allah dan hari akhir hendaklah memuliakan tetangganya; dan barangsiapa yang beriman kepada Allah dan hari akhir hendaklah memuliakan tamunya."
      }
    },
    {
      "id": 15,
      "idInBook": 15,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه و سلم أَوْصِنِي. قَالَ: لَا تَغْضَبْ، فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ\"",
      "english": {
        "narrator": "Daripada Abu Hurayrah berkata:",
        "text": "Seorang laki-laki berkata kepada Nabi s.a.w, “Berilah nasihat kepadaku”, maka beliau bersabda, “Janganlah kamu marah”. Lelaki itu mengulangi dia (selawat dan salam Allah ke atasnya) berkata, \"Jangan marah.\""
      }
    },
    {
      "id": 16,
      "idInBook": 16,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ: \"إنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ\"",
      "english": {
        "narrator": "Daripada Abu Ya’la Shaddad bin Aws, dimana Rasulullah s.a.w bersabda:",
        "text": "Sesungguhnya Allah telah mensyariatkan ihsan (kemahiran, kesempurnaan) dalam segala sesuatu. Maka jika kamu membunuh maka bunuhlah dengan baik; dan jika kamu menyembelih, maka sembelihlah dengan baik. Hendaklah kamu masing-masing mengasah bilahnya dan hendaklah ia menahan penderitaan terhadap binatang yang disembelihnya.”"
      }
    },
    {
      "id": 17,
      "idInBook": 17,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي ذَرٍّ جُنْدَبِ بْنِ جُنَادَةَ، وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ: \"اتَّقِ اللَّهَ حَيْثُمَا كُنْت، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ\" . \nرَوَاهُ التِّرْمِذِيُّ  وَقَالَ: حَدِيثٌ حَسَنٌ، وَفِي بَعْضِ النُّسَخِ: حَسَنٌ صَحِيحٌ",
      "english": {
        "narrator": "Daripada Abu Dharr Jundub ibn Junadah, dan Abu Abdur-Rahman Muadh bin Jabal (may Allah be pleased with him), dimana Rasulullah s.a.w bersabda:",
        "text": "Bertaqwalah kepada Allah di mana saja kamu berada, dan gantilah keburukan dengan kebaikan yang akan menghapusnya, dan pergaulilah manusia dengan baik."
      }
    },
    {
      "id": 18,
      "idInBook": 18,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: \"كُنْت خَلْفَ رَسُولِ اللَّهِ صلى الله عليه و سلم يَوْمًا، فَقَالَ: يَا غُلَامِ! إنِّي أُعَلِّمُك كَلِمَاتٍ: احْفَظْ اللَّهَ يَحْفَظْك، احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَك، إذَا سَأَلْت فَاسْأَلْ اللَّهَ، وَإِذَا اسْتَعَنْت فَاسْتَعِنْ بِاَللَّهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوك بِشَيْءٍ لَمْ يَنْفَعُوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَك، وَإِنْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوك بِشَيْءٍ لَمْ يَضُرُّوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْك؛ رُفِعَتْ الْأَقْلَامُ، وَجَفَّتْ الصُّحُفُ\" . رَوَاهُ التِّرْمِذِيُّ  وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ. \nوَفِي رِوَايَةِ غَيْرِ التِّرْمِذِيِّ: \"احْفَظْ اللَّهَ تَجِدْهُ أمامك، تَعَرَّفْ إلَى اللَّهِ فِي الرَّخَاءِ يَعْرِفُك فِي الشِّدَّةِ، وَاعْلَمْ أَنَّ مَا أَخْطَأَك لَمْ يَكُنْ لِيُصِيبَك، وَمَا أَصَابَك لَمْ يَكُنْ لِيُخْطِئَك، وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنْ الْفَرَجَ مَعَ الْكَرْبِ، وَأَنَّ مَعَ الْعُسْرِ يُسْرًا\"",
      "english": {
        "narrator": "Daripada Abu Abbas Abdullah bin Abbas berkata:",
        "text": "Suatu hari aku berada di belakang Rasulullah saw. Dan ketahuilah bahawa sekiranya umat itu berkumpul untuk memberi manfaat kepada kamu dengan sesuatu pun, mereka tidak akan memberi manfaat kepada kamu melainkan dengan apa yang telah ditetapkan Allah kepada kamu. Dan seandainya mereka berkumpul untuk mencelakakanmu dengan sesuatu pun, niscaya mereka tidak akan membahayakanmu kecuali dengan apa yang telah diwajibkan Allah atasmu. Pena telah diangkat dan muka surat telah kering.”"
      }
    },
    {
      "id": 19,
      "idInBook": 19,
      "chapterId": 0,
      "bookId": 10,
      "arabic": "عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو الْأَنْصَارِيِّ الْبَدْرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"إنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْت\"",
      "english": {
        "narrator": "Daripada Abu Masood Uqbah bin ’Amr al-Ansaree al-Badree berkata:",
        "text": "Rasulullah s.a.w. bersabda, “Sesungguhnya yang dipelajari oleh manusia daripada kata-kata nabi yang terdahulu ialah: Jika kamu tidak malu, maka lakukanlah sesukamu”."
      }
    }
  ]
}